vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/nvmctrl.h
/* -------- NVMCTRL_PARAM : (NVMCTRL Offset: 0x08) ( R/ 32) NVM Parameters -------- */
#define NVMCTRL_PARAM_NVMP_Pos                _UINT32_(0)                                          /* (NVMCTRL_PARAM) NVM Parameters Position */
#define NVMCTRL_PARAM_NVMP_Msk                (_UINT32_(0xFFFF) << NVMCTRL_PARAM_NVMP_Pos)         /* (NVMCTRL_PARAM) NVM Parameters Mask */
#define NVMCTRL_PARAM_NVMP(value)             (NVMCTRL_PARAM_NVMP_Msk & (_UINT32_(value) << NVMCTRL_PARAM_NVMP_Pos)) /* Assignment of value for NVMP in the NVMCTRL_PARAM register */
#define NVMCTRL_PARAM_PSZ_Pos                 _UINT32_(16)                                         /* (NVMCTRL_PARAM) Page Size Position */
#define NVMCTRL_PARAM_PSZ_Msk                 (_UINT32_(0x7) << NVMCTRL_PARAM_PSZ_Pos)             /* (NVMCTRL_PARAM) Page Size Mask */
#define NVMCTRL_PARAM_PSZ(value)              (NVMCTRL_PARAM_PSZ_Msk & (_UINT32_(value) << NVMCTRL_PARAM_PSZ_Pos)) /* Assignment of value for PSZ in the NVMCTRL_PARAM register */
#define   NVMCTRL_PARAM_PSZ_8_Val             _UINT32_(0x0)                                        /* (NVMCTRL_PARAM) 8 bytes  */
#define   NVMCTRL_PARAM_PSZ_16_Val            _UINT32_(0x1)                                        /* (NVMCTRL_PARAM) 16 bytes  */
#define   NVMCTRL_PARAM_PSZ_32_Val            _UINT32_(0x2)                                        /* (NVMCTRL_PARAM) 32 bytes  */
#define   NVMCTRL_PARAM_PSZ_64_Val            _UINT32_(0x3)                                        /* (NVMCTRL_PARAM) 64 bytes  */
#define   NVMCTRL_PARAM_PSZ_128_Val           _UINT32_(0x4)                                        /* (NVMCTRL_PARAM) 128 bytes  */
#define   NVMCTRL_PARAM_PSZ_256_Val           _UINT32_(0x5)                                        /* (NVMCTRL_PARAM) 256 bytes  */
#define   NVMCTRL_PARAM_PSZ_512_Val           _UINT32_(0x6)                                        /* (NVMCTRL_PARAM) 512 bytes  */
#define   NVMCTRL_PARAM_PSZ_1024_Val          _UINT32_(0x7)                                        /* (NVMCTRL_PARAM) 1024 bytes  */
#define NVMCTRL_PARAM_PSZ_8                   (NVMCTRL_PARAM_PSZ_8_Val << NVMCTRL_PARAM_PSZ_Pos)   /* (NVMCTRL_PARAM) 8 bytes Position */
#define NVMCTRL_PARAM_PSZ_16                  (NVMCTRL_PARAM_PSZ_16_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 16 bytes Position */
#define NVMCTRL_PARAM_PSZ_32                  (NVMCTRL_PARAM_PSZ_32_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 32 bytes Position */
#define NVMCTRL_PARAM_PSZ_64                  (NVMCTRL_PARAM_PSZ_64_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 64 bytes Position */
#define NVMCTRL_PARAM_PSZ_128                 (NVMCTRL_PARAM_PSZ_128_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 128 bytes Position */
#define NVMCTRL_PARAM_PSZ_256                 (NVMCTRL_PARAM_PSZ_256_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 256 bytes Position */
#define NVMCTRL_PARAM_PSZ_512                 (NVMCTRL_PARAM_PSZ_512_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 512 bytes Position */
#define NVMCTRL_PARAM_PSZ_1024                (NVMCTRL_PARAM_PSZ_1024_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 1024 bytes Position */
#define NVMCTRL_PARAM_BOOTPROT_Pos            _UINT32_(24)                                         /* (NVMCTRL_PARAM) Boot Section Size Position */
#define NVMCTRL_PARAM_BOOTPROT_Msk            (_UINT32_(0x7) << NVMCTRL_PARAM_BOOTPROT_Pos)        /* (NVMCTRL_PARAM) Boot Section Size Mask */
#define NVMCTRL_PARAM_BOOTPROT(value)         (NVMCTRL_PARAM_BOOTPROT_Msk & (_UINT32_(value) << NVMCTRL_PARAM_BOOTPROT_Pos)) /* Assignment of value for BOOTPROT in the NVMCTRL_PARAM register */
#define   NVMCTRL_PARAM_BOOTPROT_SIZE_32768BYTES_Val _UINT32_(0x0)                                        /* (NVMCTRL_PARAM) 32768 bytes are protected.  */
#define   NVMCTRL_PARAM_BOOTPROT_SIZE_16384BYTES_Val _UINT32_(0x1)                                        /* (NVMCTRL_PARAM) 16384 bytes are protected.  */
#define   NVMCTRL_PARAM_BOOTPROT_SIZE_8192BYTES_Val _UINT32_(0x2)                                        /* (NVMCTRL_PARAM) 8192 bytes are protected.  */
#define   NVMCTRL_PARAM_BOOTPROT_SIZE_4096BYTES_Val _UINT32_(0x3)                                        /* (NVMCTRL_PARAM) 4096 bytes are protected.  */
#define   NVMCTRL_PARAM_BOOTPROT_SIZE_2048BYTES_Val _UINT32_(0x4)                                        /* (NVMCTRL_PARAM) 2048 bytes are protected.  */
#define   NVMCTRL_PARAM_BOOTPROT_SIZE_1024BYTES_Val _UINT32_(0x5)                                        /* (NVMCTRL_PARAM) 1024 bytes are protected.  */
#define   NVMCTRL_PARAM_BOOTPROT_SIZE_512BYTES_Val _UINT32_(0x6)                                        /* (NVMCTRL_PARAM) 512 bytes are protected.  */
#define   NVMCTRL_PARAM_BOOTPROT_SIZE_0BYTES_Val _UINT32_(0x7)                                        /* (NVMCTRL_PARAM) 0 bytes are protected.  */
#define NVMCTRL_PARAM_BOOTPROT_SIZE_32768BYTES (NVMCTRL_PARAM_BOOTPROT_SIZE_32768BYTES_Val << NVMCTRL_PARAM_BOOTPROT_Pos) /* (NVMCTRL_PARAM) 32768 bytes are protected. Position */
#define NVMCTRL_PARAM_BOOTPROT_SIZE_16384BYTES (NVMCTRL_PARAM_BOOTPROT_SIZE_16384BYTES_Val << NVMCTRL_PARAM_BOOTPROT_Pos) /* (NVMCTRL_PARAM) 16384 bytes are protected. Position */
#define NVMCTRL_PARAM_BOOTPROT_SIZE_8192BYTES (NVMCTRL_PARAM_BOOTPROT_SIZE_8192BYTES_Val << NVMCTRL_PARAM_BOOTPROT_Pos) /* (NVMCTRL_PARAM) 8192 bytes are protected. Position */
#define NVMCTRL_PARAM_BOOTPROT_SIZE_4096BYTES (NVMCTRL_PARAM_BOOTPROT_SIZE_4096BYTES_Val << NVMCTRL_PARAM_BOOTPROT_Pos) /* (NVMCTRL_PARAM) 4096 bytes are protected. Position */
#define NVMCTRL_PARAM_BOOTPROT_SIZE_2048BYTES (NVMCTRL_PARAM_BOOTPROT_SIZE_2048BYTES_Val << NVMCTRL_PARAM_BOOTPROT_Pos) /* (NVMCTRL_PARAM) 2048 bytes are protected. Position */
#define NVMCTRL_PARAM_BOOTPROT_SIZE_1024BYTES (NVMCTRL_PARAM_BOOTPROT_SIZE_1024BYTES_Val << NVMCTRL_PARAM_BOOTPROT_Pos) /* (NVMCTRL_PARAM) 1024 bytes are protected. Position */
#define NVMCTRL_PARAM_BOOTPROT_SIZE_512BYTES  (NVMCTRL_PARAM_BOOTPROT_SIZE_512BYTES_Val << NVMCTRL_PARAM_BOOTPROT_Pos) /* (NVMCTRL_PARAM) 512 bytes are protected. Position */
#define NVMCTRL_PARAM_BOOTPROT_SIZE_0BYTES    (NVMCTRL_PARAM_BOOTPROT_SIZE_0BYTES_Val << NVMCTRL_PARAM_BOOTPROT_Pos) /* (NVMCTRL_PARAM) 0 bytes are protected. Position */
#define NVMCTRL_PARAM_Msk                     _UINT32_(0x0707FFFF)                                 /* (NVMCTRL_PARAM) Register Mask  */


/* -------- NVMCTRL_INTENCLR : (NVMCTRL Offset: 0x0C) (R/W 32) Interrupt Enable Clear -------- */
#define NVMCTRL_INTENCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (NVMCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

