vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/nvmctrl.h
/* -------- NVMCTRL_LOCK : (NVMCTRL Offset: 0x24) ( R/ 32) Lock Section -------- */
#define NVMCTRL_LOCK_LOCK0_Pos                _UINT32_(0)                                          /* (NVMCTRL_LOCK) Region 0 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK0_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK0_Pos)            /* (NVMCTRL_LOCK) Region 0 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK0(value)             (NVMCTRL_LOCK_LOCK0_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK0_Pos)) /* Assignment of value for LOCK0 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK1_Pos                _UINT32_(1)                                          /* (NVMCTRL_LOCK) Region 1 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK1_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK1_Pos)            /* (NVMCTRL_LOCK) Region 1 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK1(value)             (NVMCTRL_LOCK_LOCK1_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK1_Pos)) /* Assignment of value for LOCK1 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK2_Pos                _UINT32_(2)                                          /* (NVMCTRL_LOCK) Region 2 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK2_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK2_Pos)            /* (NVMCTRL_LOCK) Region 2 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK2(value)             (NVMCTRL_LOCK_LOCK2_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK2_Pos)) /* Assignment of value for LOCK2 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK3_Pos                _UINT32_(3)                                          /* (NVMCTRL_LOCK) Region 3 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK3_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK3_Pos)            /* (NVMCTRL_LOCK) Region 3 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK3(value)             (NVMCTRL_LOCK_LOCK3_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK3_Pos)) /* Assignment of value for LOCK3 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK4_Pos                _UINT32_(4)                                          /* (NVMCTRL_LOCK) Region 4 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK4_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK4_Pos)            /* (NVMCTRL_LOCK) Region 4 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK4(value)             (NVMCTRL_LOCK_LOCK4_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK4_Pos)) /* Assignment of value for LOCK4 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK5_Pos                _UINT32_(5)                                          /* (NVMCTRL_LOCK) Region 5 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK5_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK5_Pos)            /* (NVMCTRL_LOCK) Region 5 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK5(value)             (NVMCTRL_LOCK_LOCK5_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK5_Pos)) /* Assignment of value for LOCK5 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK6_Pos                _UINT32_(6)                                          /* (NVMCTRL_LOCK) Region 6 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK6_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK6_Pos)            /* (NVMCTRL_LOCK) Region 6 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK6(value)             (NVMCTRL_LOCK_LOCK6_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK6_Pos)) /* Assignment of value for LOCK6 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK7_Pos                _UINT32_(7)                                          /* (NVMCTRL_LOCK) Region 7 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK7_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK7_Pos)            /* (NVMCTRL_LOCK) Region 7 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK7(value)             (NVMCTRL_LOCK_LOCK7_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK7_Pos)) /* Assignment of value for LOCK7 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK8_Pos                _UINT32_(8)                                          /* (NVMCTRL_LOCK) Region 8 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK8_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK8_Pos)            /* (NVMCTRL_LOCK) Region 8 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK8(value)             (NVMCTRL_LOCK_LOCK8_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK8_Pos)) /* Assignment of value for LOCK8 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK9_Pos                _UINT32_(9)                                          /* (NVMCTRL_LOCK) Region 9 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK9_Msk                (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK9_Pos)            /* (NVMCTRL_LOCK) Region 9 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK9(value)             (NVMCTRL_LOCK_LOCK9_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK9_Pos)) /* Assignment of value for LOCK9 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK10_Pos               _UINT32_(10)                                         /* (NVMCTRL_LOCK) Region 10 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK10_Msk               (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK10_Pos)           /* (NVMCTRL_LOCK) Region 10 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK10(value)            (NVMCTRL_LOCK_LOCK10_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK10_Pos)) /* Assignment of value for LOCK10 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK11_Pos               _UINT32_(11)                                         /* (NVMCTRL_LOCK) Region 11 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK11_Msk               (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK11_Pos)           /* (NVMCTRL_LOCK) Region 11 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK11(value)            (NVMCTRL_LOCK_LOCK11_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK11_Pos)) /* Assignment of value for LOCK11 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK12_Pos               _UINT32_(12)                                         /* (NVMCTRL_LOCK) Region 12 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK12_Msk               (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK12_Pos)           /* (NVMCTRL_LOCK) Region 12 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK12(value)            (NVMCTRL_LOCK_LOCK12_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK12_Pos)) /* Assignment of value for LOCK12 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK13_Pos               _UINT32_(13)                                         /* (NVMCTRL_LOCK) Region 13 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK13_Msk               (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK13_Pos)           /* (NVMCTRL_LOCK) Region 13 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK13(value)            (NVMCTRL_LOCK_LOCK13_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK13_Pos)) /* Assignment of value for LOCK13 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK14_Pos               _UINT32_(14)                                         /* (NVMCTRL_LOCK) Region 14 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK14_Msk               (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK14_Pos)           /* (NVMCTRL_LOCK) Region 14 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK14(value)            (NVMCTRL_LOCK_LOCK14_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK14_Pos)) /* Assignment of value for LOCK14 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_LOCK15_Pos               _UINT32_(15)                                         /* (NVMCTRL_LOCK) Region 15 Lock Bit Position */
#define NVMCTRL_LOCK_LOCK15_Msk               (_UINT32_(0x1) << NVMCTRL_LOCK_LOCK15_Pos)           /* (NVMCTRL_LOCK) Region 15 Lock Bit Mask */
#define NVMCTRL_LOCK_LOCK15(value)            (NVMCTRL_LOCK_LOCK15_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK15_Pos)) /* Assignment of value for LOCK15 in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_Msk                      _UINT32_(0x0000FFFF)                                 /* (NVMCTRL_LOCK) Register Mask  */

#define NVMCTRL_LOCK_LOCK_Pos                 _UINT32_(0)                                          /* (NVMCTRL_LOCK Position) Region x5 Lock Bit */
#define NVMCTRL_LOCK_LOCK_Msk                 (_UINT32_(0xFFFF) << NVMCTRL_LOCK_LOCK_Pos)          /* (NVMCTRL_LOCK Mask) LOCK */
#define NVMCTRL_LOCK_LOCK(value)              (NVMCTRL_LOCK_LOCK_Msk & (_UINT32_(value) << NVMCTRL_LOCK_LOCK_Pos)) 

