vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/nvmctrl.h
/* -------- NVMCTRL_DATA : (NVMCTRL Offset: 0x28) ( R/ 32) Read Data -------- */
#define NVMCTRL_DATA_DATA_Pos                 _UINT32_(0)                                          /* (NVMCTRL_DATA) Read Data Position */
#define NVMCTRL_DATA_DATA_Msk                 (_UINT32_(0xFFFFFFFF) << NVMCTRL_DATA_DATA_Pos)      /* (NVMCTRL_DATA) Read Data Mask */
#define NVMCTRL_DATA_DATA(value)              (NVMCTRL_DATA_DATA_Msk & (_UINT32_(value) << NVMCTRL_DATA_DATA_Pos)) /* Assignment of value for DATA in the NVMCTRL_DATA register */
#define NVMCTRL_DATA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVMCTRL_DATA) Register Mask  */


/* -------- NVMCTRL_WPCTRL : (NVMCTRL Offset: 0x2C) (R/W 32) Write Protection Control -------- */
#define NVMCTRL_WPCTRL_RESETVALUE             _UINT32_(0x00)                                       /*  (NVMCTRL_WPCTRL) Write Protection Control  Reset Value */

#define NVMCTRL_WPCTRL_WPEN_Pos               _UINT32_(0)                                          /* (NVMCTRL_WPCTRL) Write Protection Enable Position */
#define NVMCTRL_WPCTRL_WPEN_Msk               (_UINT32_(0x1) << NVMCTRL_WPCTRL_WPEN_Pos)           /* (NVMCTRL_WPCTRL) Write Protection Enable Mask */
#define NVMCTRL_WPCTRL_WPEN(value)            (NVMCTRL_WPCTRL_WPEN_Msk & (_UINT32_(value) << NVMCTRL_WPCTRL_WPEN_Pos)) /* Assignment of value for WPEN in the NVMCTRL_WPCTRL register */
#define NVMCTRL_WPCTRL_WPLCK_Pos              _UINT32_(1)                                          /* (NVMCTRL_WPCTRL) Write Protection Lock Position */
#define NVMCTRL_WPCTRL_WPLCK_Msk              (_UINT32_(0x1) << NVMCTRL_WPCTRL_WPLCK_Pos)          /* (NVMCTRL_WPCTRL) Write Protection Lock Mask */
#define NVMCTRL_WPCTRL_WPLCK(value)           (NVMCTRL_WPCTRL_WPLCK_Msk & (_UINT32_(value) << NVMCTRL_WPCTRL_WPLCK_Pos)) /* Assignment of value for WPLCK in the NVMCTRL_WPCTRL register */
#define NVMCTRL_WPCTRL_WPKEY_Pos              _UINT32_(8)                                          /* (NVMCTRL_WPCTRL) Write Protection Key Position */
#define NVMCTRL_WPCTRL_WPKEY_Msk              (_UINT32_(0xFFFFFF) << NVMCTRL_WPCTRL_WPKEY_Pos)     /* (NVMCTRL_WPCTRL) Write Protection Key Mask */
#define NVMCTRL_WPCTRL_WPKEY(value)           (NVMCTRL_WPCTRL_WPKEY_Msk & (_UINT32_(value) << NVMCTRL_WPCTRL_WPKEY_Pos)) /* Assignment of value for WPKEY in the NVMCTRL_WPCTRL register */
#define   NVMCTRL_WPCTRL_WPKEY_KEY_Val        _UINT32_(0x4E564D)                                   /* (NVMCTRL_WPCTRL) Allow writes to the WPCTRL register  */
#define NVMCTRL_WPCTRL_WPKEY_KEY              (NVMCTRL_WPCTRL_WPKEY_KEY_Val << NVMCTRL_WPCTRL_WPKEY_Pos) /* (NVMCTRL_WPCTRL) Allow writes to the WPCTRL register Position */
#define NVMCTRL_WPCTRL_Msk                    _UINT32_(0xFFFFFF03)                                 /* (NVMCTRL_WPCTRL) Register Mask  */


/* NVMCTRL register offsets definitions */
#define NVMCTRL_CTRLB_REG_OFST         _UINT32_(0x04)      /* (NVMCTRL_CTRLB) Control B Offset */
#define NVMCTRL_PARAM_REG_OFST         _UINT32_(0x08)      /* (NVMCTRL_PARAM) NVM Parameters Offset */
#define NVMCTRL_INTENCLR_REG_OFST      _UINT32_(0x0C)      /* (NVMCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define NVMCTRL_INTENSET_REG_OFST      _UINT32_(0x10)      /* (NVMCTRL_INTENSET) Interrupt Enable Set Offset */
#define NVMCTRL_INTFLAG_REG_OFST       _UINT32_(0x14)      /* (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define NVMCTRL_INTFLAGSET_REG_OFST    _UINT32_(0x18)      /* (NVMCTRL_INTFLAGSET) Interrupt Flag Software Set Offset */
#define NVMCTRL_STATUS_REG_OFST        _UINT32_(0x1C)      /* (NVMCTRL_STATUS) Status Offset */
#define NVMCTRL_ADDR_REG_OFST          _UINT32_(0x20)      /* (NVMCTRL_ADDR) Address Offset */
#define NVMCTRL_LOCK_REG_OFST          _UINT32_(0x24)      /* (NVMCTRL_LOCK) Lock Section Offset */
#define NVMCTRL_DATA_REG_OFST          _UINT32_(0x28)      /* (NVMCTRL_DATA) Read Data Offset */
#define NVMCTRL_WPCTRL_REG_OFST        _UINT32_(0x2C)      /* (NVMCTRL_WPCTRL) Write Protection Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* NVMCTRL register API structure */
typedef struct
{  /* Non-Volatile Memory Controller */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       NVMCTRL_CTRLB;      /* Offset: 0x04 (R/W  32) Control B */
  __I   uint32_t                       NVMCTRL_PARAM;      /* Offset: 0x08 (R/   32) NVM Parameters */
  __IO  uint32_t                       NVMCTRL_INTENCLR;   /* Offset: 0x0C (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       NVMCTRL_INTENSET;   /* Offset: 0x10 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       NVMCTRL_INTFLAG;    /* Offset: 0x14 (R/W  32) Interrupt Flag Status and Clear */
  __IO  uint32_t                       NVMCTRL_INTFLAGSET; /* Offset: 0x18 (R/W  32) Interrupt Flag Software Set */
  __IO  uint32_t                       NVMCTRL_STATUS;     /* Offset: 0x1C (R/W  32) Status */
  __IO  uint32_t                       NVMCTRL_ADDR;       /* Offset: 0x20 (R/W  32) Address */
  __I   uint32_t                       NVMCTRL_LOCK;       /* Offset: 0x24 (R/   32) Lock Section */
  __I   uint32_t                       NVMCTRL_DATA;       /* Offset: 0x28 (R/   32) Read Data */
  __IO  uint32_t                       NVMCTRL_WPCTRL;     /* Offset: 0x2C (R/W  32) Write Protection Control */
} nvmctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_NVMCTRL_COMPONENT_H_ */
